{
    "url": "https://www.theguardian.com/commentisfree/2024/sep/24/the-guardian-view-on-keir-starmers-speech-serving-working-people-but-what-about-others",
    "title": "The Guardian view on Keir Starmer’s speech: serving working people, but what about others? | Editorial | The Guardian",
    "content": "The Guardian view on Keir Starmer’s speech: serving working people, but what about others? | Editorial | The Guardian Skip to main content Skip to navigation Close dialogue 1 / 1 Next image Previous image Toggle caption Skip to navigation Print subscriptions Search jobs Sign in Eur Europe edition UK edition US edition Australia edition International edition The Guardian - Back to home The Guardian News Opinion Sport Culture Lifestyle Show more Hide expanded menu News View all News World news UK news Climate crisis Ukraine Environment Science Global development Football Tech Business Obituaries Opinion View all Opinion The Guardian view Columnists Cartoons Opinion videos Letters Sport View all Sport Football Cricket Rugby union Tennis Cycling F1 Golf US sports Culture View all Culture Books Music TV & radio Art & design Film Games Classical Stage Lifestyle View all Lifestyle Fashion Food Recipes Love & sex Health & fitness Home & garden Women Men Family Travel Money Search input google-search Search Support us Print subscriptions Search jobs Holidays Digital Archive Guardian Licensing About Us The Guardian app Video Podcasts Pictures Newsletters Today's paper Inside the Guardian The Observer Guardian Weekly Crosswords Wordiply Corrections Search input google-search Search Search jobs Holidays Digital Archive Guardian Licensing About Us The Guardian view Columnists Cartoons Opinion videos Letters ‘Keir Starmer did hit some high notes – and a few bum ones.’ Photograph: Anadolu/Getty Images View image in fullscreen ‘Keir Starmer did hit some high notes – and a few bum ones.’ Photograph: Anadolu/Getty Images Opinion Labour conference 2024 The Guardian view on Keir Starmer’s speech: serving working people, but what about others? Editorial A crackdown on welfare and pensioner benefits signals that Labour will prioritise the interests of those in work over other sections of society Tue 24 Sep 2024 19.48 CEST Last modified on Tue 24 Sep 2024 20.26 CEST Share T here was something striking about Sir Keir Starmer’s defiance of conventional wisdom. There he was addressing his party’s annual conference – the first Labour prime minister to do so in 15 years – facing growing public unease over gifts from rich donors, internal disquiet over welfare cuts, and warnings from pollsters that his chances of re-election were dwindling. Instead of an apologetic tone, the prime minister was unrepentant about his decisions. Despite a sometimes rambling and disjointed speech, he caught the audience’s mood and received numerous standing ovations. Remarkably, he didn’t yield an inch on his domestic agenda to his critics. Sir Keir did hit some high notes – and a few bum ones. It was music to delegates’ ears in Liverpool to have a Labour prime minister promising to enact a “ Hillsborough law ” that required state bodies and private firms to truthfully assist public investigations; backing homes for veterans, young carers and victims of domestic abuse; and saying that students would be “touched by art” by being able to study creative subjects at school. Since 2010, the number of pupils taking arts GCSEs has dropped by 47%. There would be, said Sir Keir, “unpopular” decisions to repair Britain – emphasising the tension between the grassroots and the leadership. His approach to humour was revealing about how he views a profession that he joined late in life. Did a hall full of politicians think it funny that a woman in the Lake District had told the prime minister how much she hated them? Probably not. At the heart of the prime minister’s message was a cultural and economic affiliation with “ working people ”. While reflecting the fact that some of this group have concerns over high levels of immigration and the rising number of channel crossings, he sought to defuse accusations of encouraging racist sentiment by making an impassioned attack on the scourge of racism. His crackdown on welfare and pensioner benefits signals that Labour will prioritise the interests of those in work over other sections of society. The anger over cuts to winter fuel payments to elderly people is a harbinger of future rows. Sir Keir’s strategy looks like a way of engendering a public morality committed to providing collectively funded support for the employed rather than the unemployed. The test will be whether his workers’ rights proposals are watered down by business interests. Starmerite Labour has made growth the centrepiece of its programme. Like Liz Truss, Sir Keir wants the UK to grow at 2.5% a year – and in his speech there was an echo of her attacks on the “ anti-growth coalition ”. He told his party that green energy means building pylons; that communities need to love houses, not see them as eyesores; and that voters can’t complain about new prisons being built near their towns if justice is to be served. However, unlike Ms Truss, Labour’s prime minister will use the fruits of growth to pay for improving public services rather than tax cuts for the wealthy. A new social contract is needed to avoid growth coming at the expense of the environment, or all of its proceeds going to the rich. This is a danger in the UK’s rentier economy, where profit is gained from control of scarce resources. Sir Keir had little to say on such matters. But there’s growing demand for those who hold power in our economic system to start paying something back. Explore more on these topics Labour conference 2024 Opinion Labour Keir Starmer Labour conference Public services policy Welfare Benefits editorials Share Reuse this content Most viewed Most viewed The Guardian view Columnists Cartoons Opinion videos Letters News Opinion Sport Culture Lifestyle Original reporting and incisive analysis, direct from the Guardian every morning Sign up for our email Help Complaints & corrections SecureDrop Work for us Privacy policy Cookie policy Terms & conditions Contact us All topics All writers Digital newspaper archive Tax strategy Facebook YouTube Instagram LinkedIn X Newsletters Advertise with us Search UK jobs Back to top © 2024 Guardian News & Media Limited or its affiliated companies. All rights reserved. (dcr)"
}