{
    "url": "https://www.theguardian.com/info/complaints-and-corrections",
    "title": "Editorial complaints and corrections | The Guardian",
    "content": "Editorial complaints and corrections | The Guardian Skip to main content Skip to navigation Print subscriptions Search jobs Sign in Eur Europe edition UK edition US edition Australia edition International edition The Guardian - Back to home The Guardian News Opinion Sport Culture Lifestyle Show more Hide expanded menu News View all News World news UK news Climate crisis Ukraine Environment Science Global development Football Tech Business Obituaries Opinion View all Opinion The Guardian view Columnists Cartoons Opinion videos Letters Sport View all Sport Football Cricket Rugby union Tennis Cycling F1 Golf US sports Culture View all Culture Books Music TV & radio Art & design Film Games Classical Stage Lifestyle View all Lifestyle Fashion Food Recipes Love & sex Health & fitness Home & garden Women Men Family Travel Money Search input google-search Search Support us Print subscriptions Search jobs Holidays Digital Archive Guardian Licensing About Us The Guardian app Video Podcasts Pictures Newsletters Today's paper Inside the Guardian The Observer Guardian Weekly Crosswords Wordiply Corrections Search input google-search Search Search jobs Holidays Digital Archive Guardian Licensing About Us Editorial complaints & corrections How to make a complaint about Guardian or Observer editorial content For subscription, technical and other issues, visit our Help Centre What does the Guardian readers' editor do? What does the Review Panel do? Open door Hide A problem for our readers when the puzzles page presents a conundrum and the crosswords get crossed Elisabeth Ribbans A spoof after the Trump assassination attempt shows the eye to hazard needed on heavy news days Elisabeth Ribbans How misusing words can even change their dictionary definitions Elisabeth Ribbans … … comments The Guardian’s editorial code has been updated – here’s what to expect Elisabeth Ribbans More Open door Loads more stories and moves focus to first new story. Corrections & clarifications column Hide Corrections and clarifications Corrections and clarifications Corrections and clarifications Corrections and clarifications More Corrections & clarifications column Loads more stories and moves focus to first new story. Review panel decisions Hide The review panel: Clanchy decision The review panel: Lopez decision The review panel: Leidig decision The review panel: Raphael decision More Review panel decisions Loads more stories and moves focus to first new story. Further information Hide How to contact the Guardian and Observer Terms and conditions for the supply of contributions to Guardian News & Media The Guardian and Observer style guide What's next? Useful links About us Accessibility Community Contact us Contact the Guardian securely Editorial complaints and corrections FAQs Help Information Inside the Guardian blog Our values Privacy Style guide Subscribe or buy back issues of the Guardian and Observer Supplying content to Guardian News and Media Syndication and terms of use WhatsApp: sharing stories with the Guardian Explore more on these topics About Puzzle games Donald Trump Pennsylvania rally shooting Guardian Media Group Reference and languages books News Opinion Sport Culture Lifestyle Original reporting and incisive analysis, direct from the Guardian every morning Sign up for our email Help Complaints & corrections SecureDrop Work for us Privacy policy Cookie policy Terms & conditions Contact us All topics All writers Digital newspaper archive Tax strategy Facebook YouTube Instagram LinkedIn X Newsletters Advertise with us Search UK jobs Back to top © 2024 Guardian News & Media Limited or its affiliated companies. All rights reserved. (dcr)"
}