{
    "url": "https://www.theguardian.com/world/live/2024/sep/29/middle-east-crisis-live-israel-bombardment-lebanon-hezbollah-hassan-nasrallah-latest",
    "title": "Middle East crisis live: Israeli air force launches strikes on Yemen | Lebanon | The Guardian",
    "content": "Middle East crisis live: Israeli air force launches strikes on Yemen | Lebanon | The Guardian Skip to main content Skip to navigation Close dialogue 1 / 1 Next image Previous image Toggle caption Skip to key events Skip to navigation Print subscriptions Search jobs Sign in Eur Europe edition UK edition US edition Australia edition International edition The Guardian - Back to home The Guardian News Opinion Sport Culture Lifestyle Show more Hide expanded menu News View all News World news UK news Climate crisis Ukraine Environment Science Global development Football Tech Business Obituaries Opinion View all Opinion The Guardian view Columnists Cartoons Opinion videos Letters Sport View all Sport Football Cricket Rugby union Tennis Cycling F1 Golf US sports Culture View all Culture Books Music TV & radio Art & design Film Games Classical Stage Lifestyle View all Lifestyle Fashion Food Recipes Love & sex Health & fitness Home & garden Women Men Family Travel Money Search input google-search Search Support us Print subscriptions Search jobs Holidays Digital Archive Guardian Licensing About Us The Guardian app Video Podcasts Pictures Newsletters Today's paper Inside the Guardian The Observer Guardian Weekly Crosswords Wordiply Corrections Search input google-search Search Search jobs Holidays Digital Archive Guardian Licensing About Us World Europe US Americas Asia Australia Middle East Africa Inequality Global development Middle East crisis live Lebanon Middle East crisis live: Israeli air force launches strikes on Yemen IDF confirms dozens of aircraft involved in attacking what it said were ‘military targets belonging to the Houthi terrorist regime’ LIVE Updated 14m ago Maya Yang (now); Yohannes Lowe , Alexandra Topping and Helen Livingstone (earlier) Sun 29 Sep 2024 18.20 CEST First published on Sun 29 Sep 2024 09.33 CEST Share Key events 52m ago Israeli strikes on Yemen's Hodeidah port carried out with US Centcom - report 1h ago IDF confirms Israeli raid on Yemen 2h ago Airstrikes launched at Yemen's Hodeidah port 2h ago US says full-scale war is not the way to return people to homes in northern Israel 2h ago Summary of the day so far... 3h ago Body of Hezbollah leader has been recovered - report 3h ago Israeli army says over 20 Hezbollah members killed alongside group's leader in Beirut airstrike 4h ago Hezbollah confirms death of seventh senior leader 4h ago Israeli media reports: Beirut strike target was Abu Ali Rida 4h ago Anti-war rally held in Cyprus 5h ago Hezbollah announces death of senior military commander in Israeli airstrike 5h ago Summary of the day so far... 5h ago Iran vows response to killing of Iranian Revolutionary Guards deputy commander 5h ago European ministers call for immediate ceasefire in Lebanon 6h ago Death toll in Gaza reaches 41,595 says health ministry 6h ago Lebanon army makes plea for 'national unity' after assassination of Hezbollah leader 6h ago Lebanese PM to chair emergency committee meeting this afternoon 7h ago Israeli airstrike kills 11 people in Lebanon’s Bekaa valley - report 8h ago Israel says it has killed another senior Hezbollah figure 8h ago UN food agency launches emergency operation in Lebanon 9h ago Opening summary A man looks at paintings depicting late Hezbollah leader Hassan Nasrallah and Iranian General Qassem Suleimani, displayed next to a portrait of Yemen's Houthi supreme political council chairman Mahdi al-Mashat. Photograph: Yahya Arhab/EPA View image in fullscreen A man looks at paintings depicting late Hezbollah leader Hassan Nasrallah and Iranian General Qassem Suleimani, displayed next to a portrait of Yemen's Houthi supreme political council chairman Mahdi al-Mashat. Photograph: Yahya Arhab/EPA Maya Yang (now); Yohannes Lowe , Alexandra Topping and Helen Livingstone (earlier) Sun 29 Sep 2024 18.20 CEST First published on Sun 29 Sep 2024 09.33 CEST Share Show key events only Please turn on JavaScript to use this feature Live feed From 2h ago 16.52 CEST Airstrikes launched at Yemen's Hodeidah port There are reports of an airstrike on the the Red Sea port city of Hodeidah in Yemen. Reuters reports that fuel tanks were hit. Hodeidah, which has been under Houthi control since 2021, is critical for delivering food and other necessities to the Yemeni population, who depend on imports. The Iran-backed Houthis have launched missiles and drones at Israel and disrupted global trade through the Red Sea in response to Israel’s ongoing assault on Gaza. Share Updated at 18.20 CEST Key events 52m ago Israeli strikes on Yemen's Hodeidah port carried out with US Centcom - report 1h ago IDF confirms Israeli raid on Yemen 2h ago Airstrikes launched at Yemen's Hodeidah port 2h ago US says full-scale war is not the way to return people to homes in northern Israel 2h ago Summary of the day so far... 3h ago Body of Hezbollah leader has been recovered - report 3h ago Israeli army says over 20 Hezbollah members killed alongside group's leader in Beirut airstrike 4h ago Hezbollah confirms death of seventh senior leader 4h ago Israeli media reports: Beirut strike target was Abu Ali Rida 4h ago Anti-war rally held in Cyprus 5h ago Hezbollah announces death of senior military commander in Israeli airstrike 5h ago Summary of the day so far... 5h ago Iran vows response to killing of Iranian Revolutionary Guards deputy commander 5h ago European ministers call for immediate ceasefire in Lebanon 6h ago Death toll in Gaza reaches 41,595 says health ministry 6h ago Lebanon army makes plea for 'national unity' after assassination of Hezbollah leader 6h ago Lebanese PM to chair emergency committee meeting this afternoon 7h ago Israeli airstrike kills 11 people in Lebanon’s Bekaa valley - report 8h ago Israel says it has killed another senior Hezbollah figure 8h ago UN food agency launches emergency operation in Lebanon 9h ago Opening summary Show key events only Please turn on JavaScript to use this feature 13m ago 18.12 CEST Peter Beaumont The Israeli Air Force l said that the raid on Yemen had been carried out by F-15s from Israel’s Tel Nof airbase which were accompanied by support aircraft. Share 29m ago 17.55 CEST Peter Beaumont Posting on X, Israel’s defence minister, Yoav Gallant , said the raid proved that no location was too far away for Israel to hit. “‘I will hunt down my enemies and I will overtake them and I will not return until their end’ (Psalms, chapter 18, verse 38),” wrote Gallant. ”I followed the attack against the Houthis from the control room of the air force. The message is clear – for us, no place is too far,” he added. אֶרְדּוֹף אוֹיְבַי וְאַשִּׂיגֵם וְלֹא אָשׁוּב עַד כַּלּוֹתָם״ (תהלים, פרק י״ח, פסוק ל״ח). עקבתי מתא השליטה של חיל האוויר אחרי התקיפה כנגד החות׳ים. המסר ברור - עבורנו, אין מקום רחוק מידי. pic.twitter.com/1VcS8UvxzW — יואב גלנט - Yoav Gallant (@yoavgallant) September 29, 2024 Share Updated at 18.11 CEST 34m ago 17.51 CEST Peter Beaumont As well as striking Houthi targets, it seems clear that the large and sophisticated air raid on Yemen was designed to send a message to Iran that the Israeli Air Force was willing and able to launch air raids from a significant distance away. Share Updated at 17.53 CEST 44m ago 17.40 CEST Peter Beaumont Senior Houthi official Nasr ad-Din Amer, who also serves as the head of the Saba Yemeni news agency, posted on Twitter/X: The attacks failed. Precautions were taken, the oil tanks were emptied in advance at the port of Ras Issa and Hodeidah, and there was an emergency plan. The Zionists will not stop our operations under any circumstances, we will make them more qualitative. Share Updated at 17.53 CEST 50m ago 17.34 CEST Peter Beaumont While Israeli air strikes have hit Yemen before in response to drone and missile attacks, this appears to have been the largest Israeli raid on Yemen involving a large number of aircraft and hit up to 10 targets. Images from Hodeidah showed parts of the city covered in a massive pall of dust, and towering explosions seen from a distance. מקורות בתימן לאל-מיאדין: מכלי נפט עלו באש בנמל חודיידה וענני עשן גדולים כתוצאה מהתקיפה @sapirlipkin pic.twitter.com/I3vRYtxj8o — החדשות - N12 (@N12News) September 29, 2024 The IDF confirms launching airstrike against the Iran-backed Houthis in Yemen. https://t.co/6MwLlsHA17 — Emanuel (Mannie) Fabian (@manniefabian) September 29, 2024 Share 52m ago 17.32 CEST Israeli strikes on Yemen's Hodeidah port carried out with US Centcom - report Axios is reporting that an Israeli official said that the latest Israeli strikes on Yemen’s Hodeidah port was carried out with US Central Command (Centcom). According to Israeli officials, the strikes were in retaliation for the long-range ballistic missile attacks launched by Houthis on Tel Aviv in recent weeks. Share Updated at 17.39 CEST 1h ago 17.15 CEST IDF confirms Israeli raid on Yemen A statement released by the IDF described dozens of Israeli aircraft involved in the raid. Here are some of the lines from the statement: The Israeli Air Force struck Houthi terror targets in Yemen – 1,800km from the State of Israel … Today [Sunday], during an extensive, intelligence-based aerial operation, dozens of IAF aircraft – including fighter jets, mid-air refueling aircraft, and intelligence aircraft struck military targets belonging to the Houthi terrorist regime in the Ras Isa and Hudaydah areas of Yemen. The targets included power plants and a seaport used to import oil, which were used by the Houthi terrorist regime to transfer Iranian weapons to the region, in addition to military supplies and oil. The strikes were carried out in response to the recent attacks by the Houthis against the State of Israel … Over the past year, the Houthis have been operating under the direction and funding of Iran, and in cooperation with Iraqi militias in order to attack the State of Israel, undermine regional stability, and disrupt global freedom of navigation … The IDF is determined to continue operating at any distance – near or far – against all threats to the citizens of the State of Israel. Share Updated at 17.54 CEST 1h ago 17.00 CEST Peter Beaumont Peter Beaumont is a senior international reporter for the Guardian Israeli and Yemeni media are reporting a significant air strike on the Yemeni port of Hodeidah. Video posted on social media and also shared by Israeli publications suggests that oil storage facilities at the port were in an air strike. Images showed a very large explosion and a towering column of black smoke over the city. The explosion in Hodeidah follows the targeting of Israeli with a ballistic missile fired from Yemen on Saturday, with the Iran backed Houthis said was aimed at Tel Aviv’s international airport. The missile was intercepted outside Israel’s airspace. Share 2h ago 16.52 CEST Airstrikes launched at Yemen's Hodeidah port There are reports of an airstrike on the the Red Sea port city of Hodeidah in Yemen. Reuters reports that fuel tanks were hit. Hodeidah, which has been under Houthi control since 2021, is critical for delivering food and other necessities to the Yemeni population, who depend on imports. The Iran-backed Houthis have launched missiles and drones at Israel and disrupted global trade through the Red Sea in response to Israel’s ongoing assault on Gaza. Share Updated at 18.20 CEST 2h ago 16.49 CEST In his interview with CNN, John Kirby , the White House national security spokesperson, said that nobody is mourning the death of Hassan Nasrallah , the Hezbollah leader killed in Israeli airstrikes in Beirut on Friday. He said: I don’t think anybody’s mourning the loss of Mr Nasrallah, a known terrorist, a guy with American blood on his hands, as well as Israeli blood on his hands. This is a terrorist organization. He was the leader of it. And I think people are safer without him walking around. When asked what the civilian death toll of the strike was, Kirby said: “We can’t quantify that right now.” In a newly released statement, the Pentagon says the US “retains the capability to deploy forces on short notice” and is determined to prevent Iran and Iranian-backed partners and proxies from “exploiting the situation or expanding the conflict”. The US says its priority is ensuring the protection of US citizens and forces in the region, defending Israel and cooling tensions across the region through “deterrence and diplomacy”. Share Updated at 16.54 CEST 2h ago 16.47 CEST US says full-scale war is not the way to return people to homes in northern Israel White House national security spokesperson John Kirby has said Israel will not be able to safely get people back into their homes in the north of the country by waging a full-scale war with Hezbollah or Iran. Israel has claimed that its goal is to make its northern areas safe from Hezbollah rocket fire and allow thousands of displaced residents to return. “An all-out war with Hezbollah, certainly with Iran , is not the way to do that. If you want to get those folks back home safely and sustainably, we believe that a diplomatic path is the right course,” Kirby told CNN. The US is watching to see what Hezbollah does to try to fill its leadership vacuum “and is continuing to talk to the Israelis about what the right next steps are”, he said after news that much of Hezbollah’s leadership has been killed by the Israeli military. “We have made no bones about the fact that we don’t necessarily see the tactical execution the same way that they do in terms of protection (of civilians),” Kirby said. He added that the US’s support for Israel remains intact. Washington is by far the biggest arms supplier to Israel. Share Updated at 16.54 CEST 2h ago 16.38 CEST Summary of the day so far... Iran’s foreign minister, Abbas Araqchi , said the killing of Brigadier General Abbas Nilforoushan , an Iranian Revolutionary Guard Corps (IRGC) deputy commander, by Israel was a “horrible crime” that would not go unanswered. Nilforoushan was killed in the Israeli strikes on Beirut on Friday, in which Hezbollah leader Hassan Nasrallah was also assassinated. Nasrallah’s body has been recovered intact from the site of Friday’s strike, a medical source and a security source told Reuters . Israel said that it killed 20 Hezbollah figures alongside Nasrallah in its attack on the group’s underground headquarters on Friday. Ali Karaki , leader of Hezbollah’s southern front, and Ibrahim Hussein Jazini , head of Nasrallah’s security unit, were also among those killed, the IDF said. The Israeli military also said on Sunday that it killed senior Hezbollah figure Nabil Kaouk in an airstrike in Lebanon yesterday. Hezbollah later confirmed his death. He is the seventh senior leader of the Lebanese militant group to be killed since 20 September. The Israeli military has carried out new attacks on Lebanon today, including on Dahiyeh , a southern suburb of the capital, Beirut, and on Bekaa Valley in north-eastern Lebanon. Hezbollah was reported to have fired rockets at the Ofek military base in northern Israel earlier today and has been targeting Israel’s Sa’ar settlement with rocket strikes. European foreign ministers, including officials from the UK, Germany and France, have stepped up calls for a ceasefire between Israel and Hezbollah amid fears of the conflict spreading across the region. The Lebanese army said it “calls on citizens to preserve national unity and not to be drawn into actions that may affect civil peace at this dangerous and delicate stage”. The country’s prime minister, Najib Mikati , urged Lebanese people “to come together” to preserve civil order. Diplomatic efforts for a ceasefire with Israel are ongoing. The UN World Food Programme (WFP) launched an emergency operation to provide food for up to 1 million people affected by the conflict in Lebanon. More than 1,000 people have been killed in Lebanon and more than 6,000 injured as a result of Israeli attacks in the past two weeks, the health ministry said, and about one million Lebanese people have been displaced by Israeli strikes. At least 41,595 Palestinian people have been killed and 96,251 injured in Israeli strikes on Gaza since 7 October, the Gaza health ministry said . Share Updated at 16.41 CEST 2h ago 16.24 CEST The Lebanese health ministry has said that 14 paramedics had been killed in two days of intense Israeli bombardment in Lebanon’s east and south and in Beirut, the capital. “This series of attacks killed 14 paramedics in two days,” the ministry said in a statement, adding it “condemns in the strongest terms the Israeli enemy’s repeated attacks on medical centres” and that “paramedics do not participate in hostilities”. Share 2h ago 16.22 CEST The Israeli military has carried out new attacks on Lebanon today, including on Dahiyeh, a southern suburb of the capital, Beirut, and on Bekaa Valley in north-eastern Lebanon. Israel's air campaign in Lebanon. Israel’s air campaign in Lebanon. Share 1 of 4 Next Oldest Oldest Explore more on these topics Lebanon Middle East crisis live Israel Hezbollah Gaza Israel-Gaza war Hamas Iran Share Reuse this content More on this story More on this story Which Hezbollah leaders have been killed and who will succeed Hassan Nasrallah? 2h ago Impact of Hezbollah assassinations may take months to emerge 5h ago ‘World of horrors’: families huddle on Beirut’s streets amid the bombs 21h ago European ministers call for immediate ceasefire in Lebanon 6h ago Iran vows vengeance after assassination of Hezbollah leader Hassan Nasrallah 23h ago Israel’s strike on Lebanon killed five of my family members, says British woman 23h ago ‘Leave now’, Foreign Office urges Britons in Lebanon 21h ago The killing of Hassan Nasrallah leaves Iran with a fateful choice and the US humiliated 23h ago Hassan Nasrallah: Hezbollah’s leader inspired adulation and bitter enmity – they will find him very hard to replace 1d ago Most viewed Most viewed World Europe US Americas Asia Australia Middle East Africa Inequality Global development News Opinion Sport Culture Lifestyle Original reporting and incisive analysis, direct from the Guardian every morning Sign up for our email Help Complaints & corrections SecureDrop Work for us Privacy policy Cookie policy Terms & conditions Contact us All topics All writers Digital newspaper archive Tax strategy Facebook YouTube Instagram LinkedIn X Newsletters Advertise with us Search UK jobs Back to top © 2024 Guardian News & Media Limited or its affiliated companies. All rights reserved. (dcr)"
}